app/services/balance_changer.rb

INSERT INTO "invoices" ("amount", "operator", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["amount", 10], ["operator", "+"], ["created_at", "2023-09-05 16:26:58.527480"], ["updated_at", "2023-09-05 16:26:58.527480"], ["user_id", 1]]
---
  def change_balance(operator, num)
    user.with_lock {
      user.balance = user.balance.send(operator, num)

      errors << 'negative balance' and return if user.balance < 0

      user.invoices.build(amount: num, operator: operator)

      user.save!