app/controllers/invoices_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def user
    @user ||= User.find(params[:user_id])