app/controllers/users_controller.rb

  def index
    # TODO: pagination
    render json: UserSerializer.new(User.all).serializable_hash
---
SELECT "users".* FROM "users"

  def create
    user = User.new(name: params[:name], balance: 0)
    user.save!
---
INSERT INTO "users" ("name") VALUES ($1) RETURNING "id"  [["name", "proba"]]